mcapdeville/esp32s3aprs/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_BOOTLOADER_COMPILER_OPTIMIZATION_PERF=y
# CONFIG_BOOTLOADER_FLASH_XMC_SUPPORT is not set
CONFIG_BOOTLOADER_SKIP_VALIDATE_IN_DEEP_SLEEP=y
CONFIG_APP_RETRIEVE_LEN_ELF_SHA=16
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions-2M.csv"
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_DISABLE=y
CONFIG_COMPILER_WARN_WRITE_STRINGS=y
CONFIG_ADC_CONTINUOUS_ISR_IRAM_SAFE=y
CONFIG_ADC_CONTINUOUS_NUM_DMA=16
# CONFIG_ESP_ERR_TO_NAME_LOOKUP is not set
CONFIG_GPIO_CTRL_FUNC_IN_IRAM=y
CONFIG_I2S_ISR_IRAM_SAFE=y
# CONFIG_I2S_FORCE_FRAC_DIVISOR is not set
# CONFIG_SPI_SLAVE_ISR_IN_IRAM is not set
CONFIG_UART_ISR_IN_IRAM=y
# CONFIG_USJ_ENABLE_USB_SERIAL_JTAG is not set
# CONFIG_ETH_USE_SPI_ETHERNET is not set
# CONFIG_ESP_EVENT_POST_FROM_ISR is not set
CONFIG_ESP32S3_REV_MIN_2=y
CONFIG_ESP32S3_UNIVERSAL_MAC_ADDRESSES_TWO=y
# CONFIG_ESP_SLEEP_GPIO_RESET_WORKAROUND is not set
CONFIG_ESP_BROWNOUT_DET_LVL_SEL_2=y
CONFIG_LIBC_STDIN_LINE_ENDING_LF=y
CONFIG_ESP_MM_CACHE_MSYNC_C2M_CHUNKED_OPS=y
CONFIG_ESP_NETIF_LOOPBACK=y
# CONFIG_ESP_NETIF_REPORT_DATA_TRAFFIC is not set
# CONFIG_ESP_PHY_CALIBRATION_AND_DATA_STORAGE is not set
# CONFIG_ESP_PHY_ENABLE_USB is not set
CONFIG_ESP_PHY_RF_CAL_NONE=y
CONFIG_PM_ENABLE=y
CONFIG_PM_LIGHTSLEEP_RTC_OSC_CAL_INTERVAL=10
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP32S3_INSTRUCTION_CACHE_32KB=y
CONFIG_ESP32S3_RTCDATA_IN_FAST_MEM=y
# CONFIG_ESP_SYSTEM_ALLOW_RTC_FAST_MEM_AS_HEAP is not set
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=3072
CONFIG_ESP_MAIN_TASK_STACK_SIZE=3072
CONFIG_ESP_MAIN_TASK_AFFINITY_CPU1=y
CONFIG_ESP_MINIMAL_SHARED_STACK_SIZE=4096
# CONFIG_ESP_TASK_WDT_EN is not set
CONFIG_ESP_PANIC_HANDLER_IRAM=y
# CONFIG_ESP_DEBUG_OCDAWARE is not set
# CONFIG_ESP_SYSTEM_BBPLL_RECALIB is not set
CONFIG_ESP_TIMER_TASK_STACK_SIZE=2048
# CONFIG_ESP_WIFI_GMAC_SUPPORT is not set
# CONFIG_ESP_WIFI_SOFTAP_SUPPORT is not set
# CONFIG_ESP_WIFI_ENTERPRISE_SUPPORT is not set
CONFIG_FREERTOS_CHECK_STACKOVERFLOW_NONE=y
CONFIG_FREERTOS_MAX_TASK_NAME_LEN=8
CONFIG_FREERTOS_TIMER_TASK_AFFINITY_CPU0=y
CONFIG_FREERTOS_USE_TICKLESS_IDLE=y
# CONFIG_FREERTOS_TLSP_DELETION_CALLBACKS is not set
# CONFIG_FREERTOS_CHECK_MUTEX_GIVEN_BY_OWNER is not set
# CONFIG_FREERTOS_INTERRUPT_BACKTRACE is not set
CONFIG_HAL_ASSERTION_DISABLE=y
CONFIG_HEAP_ABORT_WHEN_ALLOCATION_FAILS=y
CONFIG_LOG_DEFAULT_LEVEL_WARN=y
CONFIG_LOG_MAXIMUM_LEVEL_INFO=y
CONFIG_LOG_MASTER_LEVEL=y
CONFIG_LOG_COLORS=y
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=5744
CONFIG_LWIP_TCP_WND_DEFAULT=5744
CONFIG_LWIP_HOOK_IP6_INPUT_NONE=y
CONFIG_MBEDTLS_ECP_FIXED_POINT_OPTIM=y
# CONFIG_SPI_FLASH_BROWNOUT_RESET_XMC is not set
# CONFIG_SPI_FLASH_ENABLE_ENCRYPTED_READ_WRITE is not set
CONFIG_ULP_COPROC_ENABLED=y
CONFIG_ESP32S3APRS_RADIO_FRAME_LEN=24
CONFIG_LV_COLOR_DEPTH_1=y
CONFIG_LV_DISP_DEF_REFR_PERIOD=100
# CONFIG_LV_DRAW_COMPLEX is not set
# CONFIG_LV_FONT_MONTSERRAT_14 is not set
CONFIG_LV_FONT_DEFAULT_MONTSERRAT_16=y
# CONFIG_LV_LABEL_TEXT_SELECTION is not set
# CONFIG_LV_LABEL_LONG_TXT_HINT is not set
# CONFIG_LV_USE_ANIMIMG is not set
# CONFIG_LV_USE_CALENDAR is not set
# CONFIG_LV_USE_CHART is not set
# CONFIG_LV_USE_COLORWHEEL is not set
# CONFIG_LV_USE_IMGBTN is not set
# CONFIG_LV_USE_KEYBOARD is not set
# CONFIG_LV_USE_LED is not set
# CONFIG_LV_USE_METER is not set
# CONFIG_LV_USE_MSGBOX is not set
# CONFIG_LV_USE_SPAN is not set
# CONFIG_LV_USE_SPINNER is not set
# CONFIG_LV_USE_TILEVIEW is not set
# CONFIG_LV_USE_WIN is not set
# CONFIG_LV_USE_THEME_MONO is not set
# CONFIG_LV_USE_GRID is not set
# CONFIG_LV_USE_SNAPSHOT is not set
CONFIG_LV_USE_IMGFONT=y
# CONFIG_LV_BUILD_EXAMPLES is not set
CONFIG_MICROPY_ROM_LEVEL_BASIC=y
CONFIG_MICROPY_FROZEN_MANIFEST="$(PROJECT_DIR)/manifest.py"
CONFIG_MICROPY_HW_BOARD_NAME="ESP32s3APRS"
CONFIG_MICROPY_PERSISTENT_CODE_LOAD=y
CONFIG_MICROPY_BUILTIN_INIT=y
CONFIG_MICROPY_EXTERNAL_MODULE=y
CONFIG_MICROPY_MODULE_FROZEN=y
CONFIG_MICROPY_VFS=y
CONFIG_MICROPY_VFS_POSIX=y
CONFIG_MICROPY_HELPER_REPL=y
CONFIG_MICROPY_REPL_AUTO_INDENT=y
CONFIG_MICROPY_GC=y
CONFIG_MICROPY_SYS_PATH_DEFAULT="/spiffs:.frozen"
CONFIG_MICROPY_BTREE=y
